Revit 2020 API
PolyLine Properties
The PolyLine type exposes the following members.
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
NumberOfCoordinates
Gets the number of the coordinate points.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
PolyLine Class
Autodesk.Revit.DB Namespace